INSERT INTO `timetable`.`eixo`
(
`descricao`)
VALUES
("COMPUTAÇÃO");


INSERT INTO `timetable`.`curso`
(`nome`,
`ativo`,
`eixo`)
VALUES
("CIÊNCIA DA COMPUTAÇÃO",true,1),
("TÉCNICO EM INFORMÁTICA",true,1);

INSERT INTO `timetable`.`curso_periodos`
(`turno`,
`qtde_periodos`,
`curso`)
VALUES
(1,2,1),
(2,2,1),
(2,2,2);



INSERT INTO `timetable`.`matriz_curricular`
(`curso`,
`nome`,
`ativo`)
VALUES
(1,"2014-2",true),
(2,"2012-2",true);

INSERT INTO `timetable`.`matriz_disciplinas`
(`matriz`,
`disciplina`,
`semestre`)
VALUES
(2, 1, 1),
(2, 2, 1),
(2, 3, 1),
(2, 4, 1),
(2, 5, 1),

(2, 6, 2),
(2, 7, 2),
(2, 8, 2),

(2, 9, 3),
(2, 10, 3),
(2, 11, 3),
(2, 12, 3),

(2, 13, 4),
(2, 14, 4),
(2, 15, 4),

/**computacao**/

(1, 16, 1),
(1, 17, 1),
(1, 18, 1),
(1, 19, 1),


(1, 20, 2),
(1, 21, 2),
(1, 22, 2),
(1, 23, 2),
(1, 24, 2),


(1, 25, 3),
(1, 26, 3),
(1, 27, 3),
(1, 28, 3),
(1, 29, 3),

(1, 30, 4),
(1, 31, 4),
(1, 32, 4),
(1, 33, 4),
(1, 34, 4),

(1, 35, 5),
(1, 36, 5),
(1, 37, 5),
(1, 38, 5),
(1, 8, 5),

(1, 39, 6),
(1, 40, 6),
(1, 41, 6),
(1, 42, 6),

(1, 43, 7),
(1, 44, 7),
(1, 45, 7),
(1, 46, 7),

(1, 47, 8),
(1, 48, 8),
(1, 49, 8),
(1, 50, 8),
(1, 51, 8),
(1, 52, 8),
(1, 53, 8),
(1, 54, 8),
(1, 55, 8),
(1, 56, 8),
(1, 57, 8),
(1, 58, 8),
(1, 59, 8),
(1, 60, 8),
(1, 61, 8),
(1, 62, 8),
(1, 63, 8),
(1, 64, 8),
(1, 65, 8),
(1, 66, 8),
(1, 67, 8),
(1, 68, 8),
(1, 69, 8),
(1, 70, 8);